bit-finance/Catalogs/бит_СтатьиБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиБюджета</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование элемента справочника для вывода на печать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код. Используется для вывода в отчетах и печатных формах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображать</Name>
					<Comment>Не отображать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьТекстКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/CommonModules/бит_ОтчетыСРасчетамиСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, используемые для работы с расчетами в отчетах.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ВспомогательныеДанные

// Функция формирует имя параметра, используемое в запросе.
//
// Параметры:
//  НомерПараметра - Число.
//
// Возвращаемое значение:
//  Строка - имя параметра запроса.
//
Функция ИмяПараметраЗапроса(НомерПараметра) Экспорт

	Возврат СтрШаблон("ПараметрРасчетов%1", НомерПараметра);

КонецФункции

// Функция формирует текст списка аналитик для запроса.
//
// Возвращаемое значение:
//  Строка - текст списка аналитик запроса.
//
Функция ТекстАналитикДляШаблонаРезультата() Экспорт

	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ТекстАналитик = 
		"	ВТРасчет.Проект,
		|	ВТРасчет.Контрагент,
		|	ВТРасчет.ДоговорКонтрагента,		
		|	ВТРасчет.НоменклатурнаяГруппа,
		|	ВТРасчет.БанковскийСчет,
		|	ВТРасчет.Аналитика_1,
		|	ВТРасчет.Аналитика_2,
		|	ВТРасчет.Аналитика_3,
		|	ВТРасчет.Аналитика_4,
		|	ВТРасчет.Аналитика_5,
		|	ВТРасчет.Аналитика_6,
		|	ВТРасчет.Аналитика_7,";
	Иначе	
		ТекстАналитик = 
		"	ВТРасчет.Аналитика_1,
		|	ВТРасчет.Аналитика_2,
		|	ВТРасчет.Аналитика_3,
		|	ВТРасчет.Аналитика_4,
		|	ВТРасчет.Аналитика_5,
		|	ВТРасчет.Аналитика_6,
		|	ВТРасчет.Аналитика_7,
		|	ВТРасчет.Аналитика_8,
		|	ВТРасчет.Аналитика_9,
		|	ВТРасчет.Аналитика_10,
		|	ВТРасчет.Аналитика_11,
		|	ВТРасчет.Аналитика_12,";
	КонецЕсли;
	
	Возврат ТекстАналитик;

КонецФункции

#КонецОбласти 

// Конструктор параметров процедуры изменения СКД для рассчетов.
//
// Возвращаемое значение:
//	Структура:
//  * МенеджерОтчета - ОтчетМенеджер.
//  * СхемаКомпоновкиДанных - СхемаКомпоновкиДанных.
//  * КомпоновщикНастроек - КомпоновщикНастроекКомпановкиДанных.
//  * ПутьКНаборуДанных - Строка - Путь к модифицируемому набору данных.
//	* КоличествоВариацийРесурсов - Число - Количесвто вариаций ресурсов сумма и количество (пример: Сумма1, Сумма2 и т.д.)
//
Функция НовыеПараметрыМодификацииСКДДляРасчетов() Экспорт
	
	ПараметрыМодификации = Новый Структура;
	
	ПараметрыМодификации.Вставить("МенеджерОтчета");
	ПараметрыМодификации.Вставить("СхемаКомпоновкиДанных");
	ПараметрыМодификации.Вставить("СхемаКомпоновкиДанныхПоУмолчанию");
	ПараметрыМодификации.Вставить("КомпоновщикНастроек");
	ПараметрыМодификации.Вставить("ПутьКНаборуДанных", "");
	ПараметрыМодификации.Вставить("КоличествоВариацийРесурсов", 1);
	ПараметрыМодификации.Вставить("ШаблонТекстаРасчета", "");
	
	ОписаниеРесурсов = Новый ТаблицаЗначений;
	ОписаниеРесурсов.Колонки.Добавить("ИмяРесурса");
	ОписаниеРесурсов.Колонки.Добавить("ВидРесурса");
	ОписаниеРесурсов.Колонки.Добавить("Вариация", Новый ОписаниеТипов("Число",
												 Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный)));
	ПараметрыМодификации.Вставить("ОписаниеРесурсов", ОписаниеРесурсов);
	
	Возврат ПараметрыМодификации;

	
КонецФункции

// Процедура меняет текст запроса для СКД и подставляет фиксированные параметры.
//
// Параметры:
//  ПараметрыМодификации - Структура - См. НовыеПараметрыМодификацииСКДДляРасчетов()
//
Процедура ИзменитьСКДДляРасчетов(ПараметрыМодификации) Экспорт
	
	ПараметрыСКД = ПараметрыМодификации.СхемаКомпоновкиДанных.Параметры;
		
	ПараметрыОтчета = Новый Структура;
	Для каждого ЭлементПараметр Из ПараметрыМодификации.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПараметрыОтчета.Вставить(Строка(ЭлементПараметр.Параметр), ЭлементПараметр.Значение);
			Если ЭлементПараметр.Параметр = Новый ПараметрКомпоновкиДанных("Расчеты") Тогда
				ПараметрыОтчета.Вставить("ВсеРасчеты", НЕ ЭлементПараметр.Использование);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
			
	// Удаление лишних параметров.
	КоличествоПараметров = ПараметрыСКД.Количество();
	Сч = КоличествоПараметров-1;
	Пока Сч >= 0 Цикл
		ПараметрСхемы = ПараметрыСКД[Сч];	
		Если НЕ ЗначениеЗаполнено(ПараметрСхемы.ТипЗначения) Тогда
			ПараметрыСКД.Удалить(ПараметрСхемы);	
		КонецЕсли;	
		Сч = Сч - 1;
	КонецЦикла;
	
	Если НЕ ПараметрыОтчета.ПоБюджету ИЛИ НЕ ЗначениеЗаполнено(ПараметрыОтчета.Бюджет) Тогда
		Возврат;		
	КонецЕсли;
	
	// Список расчетов.
	Если ПараметрыОтчета.ВсеРасчеты Тогда
		РасчетыБюджета = ВсеРасчетыБюджета(ПараметрыОтчета.Бюджет);
	Иначе	
		РасчетыБюджета = ПараметрыОтчета.Расчеты;
		Если РасчетыБюджета = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	// Изменение запроса по расчетам.
	ВременныеГруппыРасчетов = Новый Соответствие;
	
	ПараметрыЗапроса = Новый Структура;
	ВсеПараметрыЗапроса    = Новый СписокЗначений;
	ПараметрыСтатьиПростые = Новый СписокЗначений;
	ПараметрыСтатьиСложные = Новый СписокЗначений;
	ПараметрыЗапроса.Вставить("ВсеПараметрыЗапроса"	  , ВсеПараметрыЗапроса);
	ПараметрыЗапроса.Вставить("ПараметрыСтатьиПростые", ПараметрыСтатьиПростые);
	ПараметрыЗапроса.Вставить("ПараметрыСтатьиСложные", ПараметрыСтатьиСложные);
	
	ДанныеРасчетов = ДанныеРасчетовОтчета(РасчетыБюджета, ПараметрыЗапроса);
	
	НастроитьТекстЗапросаИФормулыИтогов(ПараметрыМодификации, ПараметрыЗапроса, ДанныеРасчетов);
	
	// Установка параметров в СКД.
	УстановитьПараметрыОтчетаСРасчетами(ПараметрыСКД, ВсеПараметрыЗапроса);	

КонецПроцедуры

// Процедура формирует список параметров расчетов.
//
// Параметры:
//  СтатьяБюджета    - СправочникСсылка.бит_СтатьиБюджета.
//  ПараметрыРасчета - СписокЗначений.
//
Процедура ПараметрыРасчета(СтатьяБюджета, ПараметрыРасчета) Экспорт

	Для каждого ПараметрРасчета Из СтатьяБюджета.ПараметрыРасчета Цикл
		ЗначениеПараметра = ПараметрРасчета.ЗначениеПараметра;
		Если ЗначениеПараметра.ЭтоГруппа ИЛИ НЕ ЗначениеПараметра.ЭтоРасчет Тогда
			ПараметрыРасчета.Добавить(ЗначениеПараметра);
		Иначе
			ПараметрыРасчета(ЗначениеПараметра, ПараметрыРасчета);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВспомогательныеДанные

// Данные расчетов отчета.

// Процедура заполняет списки параметров.
//
// Параметры:
//  ТекущееЗначение     - СправочникСсылка.бит_СтатьиБюджета.
//  ИмяПараметра        - Строка.
//  ВсеПараметры        - СписокЗначений.
//  ВыборочныеПараметры - СписокЗначений.
//  ПараметрыРасчета 	- СписокЗначений.
//
Процедура ДополнитьСпискиПараметров(ТекущееЗначение, ИмяПараметра, ВсеПараметры, ВыборочныеПараметры, ПараметрыРасчета)

	НайденныйПараметр = ВсеПараметры.НайтиПоЗначению(ТекущееЗначение);
	Если НайденныйПараметр = Неопределено Тогда	
		// Список всех параметров.
		ВсеПараметры.Добавить(ТекущееЗначение, ИмяПараметра);
		// Список простых или сложных параметров.
		ВыборочныеПараметры.Добавить(ТекущееЗначение, ИмяПараметра);
		// Идентификатор параметра в пределах одного расчета.
		ПараметрыРасчета.Добавить(ТекущееЗначение, ИмяПараметра);
	Иначе
		ИмяПараметра = НайденныйПараметр.Представление;		
		// Список простых или сложных параметров.
		НайденныйВыборочныйПараметр = ВыборочныеПараметры.НайтиПоЗначению(ТекущееЗначение);
		Если НайденныйВыборочныйПараметр = Неопределено Тогда
			ВыборочныеПараметры.Добавить(ТекущееЗначение, ИмяПараметра);
		КонецЕсли;
		// Идентификатор параметра в пределах одного расчета.
		НайденныйПараметрРасчета = ПараметрыРасчета.НайтиПоЗначению(ТекущееЗначение);
		Если НайденныйПараметрРасчета = Неопределено Тогда
			ПараметрыРасчета.Добавить(ТекущееЗначение, ИмяПараметра);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры	
		
// Процедура заполняет формулу расчета параметрами для запроса по статье.
//
// Параметры:
//  ПараметрыЗапроса - Структура:
//  					ВсеПараметрыЗапроса    - СписокЗначений.
//  					ПараметрыСтатьиПростые - СписокЗначений.
//  					ПараметрыСтатьиСложные - СписокЗначений.
//						ПоПериодам			   - Булево.
//  ФормулаРасчета 	 - Строка.
//  ПараметрыРасчета - СписокЗначений.
//  ТекущееИмя 		 - Строка.
//  ТекущееЗначение  - СправочникСсылка.бит_СтатьиБюджета.
//  ЭтоСложныйРасчет - Булево
//
Процедура ОпределитьПараметрВСписке(ПараметрыЗапроса, ФормулаРасчета, ПараметрыРасчета, ТекущееИмя, ТекущееЗначение, ЭтоСложныйРасчет)
			
	ВсеПараметрыЗапроса    = ПараметрыЗапроса.ВсеПараметрыЗапроса;
	ПараметрыСтатьиПростые = ПараметрыЗапроса.ПараметрыСтатьиПростые;
	ПараметрыСтатьиСложные = ПараметрыЗапроса.ПараметрыСтатьиСложные;
		
	КоличествоПараметров = ВсеПараметрыЗапроса.Количество();
	ИмяПараметра = ИмяПараметраЗапроса(КоличествоПараметров+1);
	
	Если ЭтоСложныйРасчет Тогда		
		ДополнитьСпискиПараметров(ТекущееЗначение, ИмяПараметра, ВсеПараметрыЗапроса, ПараметрыСтатьиСложные, ПараметрыРасчета);				
	Иначе
		ДополнитьСпискиПараметров(ТекущееЗначение, ИмяПараметра, ВсеПараметрыЗапроса, ПараметрыСтатьиПростые, ПараметрыРасчета);		
	КонецЕсли;
		
	ТекстКоличество = НСтр("ru='.Количество]';en='.Quantity]'");
	Если Найти(ФормулаРасчета, ТекстКоличество) <> 0 Тогда
		ИмяКоличествоСтарое = СтрЗаменить(ТекущееИмя, "]", ТекстКоличество);
		ИмяКоличествоНовое  = СтрШаблон("[%1.Количество]", ИмяПараметра);
		ФормулаРасчета = СтрЗаменить(ФормулаРасчета, ИмяКоличествоСтарое, ИмяКоличествоНовое);	
	КонецЕсли;	
	ФормулаРасчета = СтрЗаменить(ФормулаРасчета, ТекущееИмя, СтрШаблон("[%1]", ИмяПараметра));
	
	ПараметрыЗапроса.Вставить("ВсеПараметрыЗапроса"	  , ВсеПараметрыЗапроса);
	ПараметрыЗапроса.Вставить("ПараметрыСтатьиПростые", ПараметрыСтатьиПростые);
	ПараметрыЗапроса.Вставить("ПараметрыСтатьиСложные", ПараметрыСтатьиСложные);
		
КонецПроцедуры

// Процедура заполняет формулу расчета параметрами для запроса.
//
// Параметры:
//  ПараметрыЗапроса - Структура:
//  					ВсеПараметрыЗапроса    - СписокЗначений.
//  					ПараметрыСтатьиПростые - СписокЗначений.
//  					ПараметрыСтатьиСложные - СписокЗначений.
//						ПоПериодам			   - Булево.
//  ФормулаРасчета 	   - Строка.
//  ПараметрыРасчета   - СписокЗначений.
//  ВыборкаПараметров  - ВыборкаРезультатаЗапроса.
//  ЕстьНедоступныеСсылки - Булево
//
Процедура ЗаполнитьПараметрыПоТекущему(ПараметрыЗапроса, ФормулаРасчета, ПараметрыРасчета, ВыборкаПараметров, 
									   ЕстьНедоступныеСсылки, ЭтоСложныйРасчет)
	
	ТекущееИмя 	  	= ВыборкаПараметров.ИмяПараметра;
	ТекущееЗначение = ВыборкаПараметров.ЗначениеПараметра;
	
	Если НЕ ЗначениеЗаполнено(ТекущееЗначение) Тогда
		ТекстСообщения = НСтр("ru='Ошибка в параметрах расчетов. Пустое значение.'; 
							  |en='Error in calculation parameters. Empty value.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
		Возврат;
	КонецЕсли;
	
	Попытка
		НайденныйОбъект = ТекущееЗначение.ПолучитьОбъект();
	Исключение
		ЕстьНедоступныеСсылки = Истина;
		Возврат;
	КонецПопытки;
	
	Если ВыборкаПараметров.ЭтоРасчет Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Расчет", ТекущееЗначение);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеРасчетов.Ссылка КАК Ссылка,
		|	ДанныеРасчетов.ФормулаРасчета КАК ФормулаРасчета,
		|	ДанныеРасчетов.Кодификатор КАК Кодификатор,
		|	РасчетыПараметрыРасчета.ИмяПараметра КАК ИмяПараметра,
		|	РасчетыПараметрыРасчета.ЗначениеПараметра КАК ЗначениеПараметра,
		|	ЕстьNULL(СтатьиБюджета.ЭтоРасчет, ЛОЖЬ) КАК ЭтоРасчет,
		|	ЕстьNULL(СтатьиБюджета.ЭтоГруппа, ЛОЖЬ) КАК ЭтоГруппа
		|ИЗ
		|	Справочник.бит_СтатьиБюджета КАК ДанныеРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СтатьиБюджета.ПараметрыРасчета КАК РасчетыПараметрыРасчета
		|		ПО (ДанныеРасчетов.Ссылка = РасчетыПараметрыРасчета.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СтатьиБюджета КАК СтатьиБюджета
		|			ПО (РасчетыПараметрыРасчета.ЗначениеПараметра = СтатьиБюджета.Ссылка)
		|ГДЕ
		|	ДанныеРасчетов.Ссылка = &Расчет
		|ИТОГИ ПО
		|	Ссылка";
		Результат = Запрос.Выполнить();	
		ВыборкаРасчетов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаРасчетов.Следующий() Цикл
			ВыборкаПараметровНиз = ВыборкаРасчетов.Выбрать();
			ТекущаяФормулаРасчета = ВыборкаРасчетов.ФормулаРасчета;
			Пока ВыборкаПараметровНиз.Следующий() Цикл
				ЗаполнитьПараметрыПоТекущему(ПараметрыЗапроса, ТекущаяФормулаРасчета, ПараметрыРасчета, ВыборкаПараметровНиз, 
					ЕстьНедоступныеСсылки, ЭтоСложныйРасчет);	
			КонецЦикла;
			ФормулаРасчета = СтрЗаменить(ФормулаРасчета, ТекущееИмя, "(" + ТекущаяФормулаРасчета+ ")");
		КонецЦикла;
		
	Иначе
		
		ОпределитьПараметрВСписке(ПараметрыЗапроса, ФормулаРасчета, ПараметрыРасчета, ТекущееИмя, ТекущееЗначение, 
			ЭтоСложныйРасчет);		
				
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПараметрыПоТекущему()

// Функция заполняет формулу расчета параметрами для запроса.
//
// Параметры:
//  ВыбранныеРасчеты - Массив.
//  ПараметрыЗапроса - Структура:
//  					ВсеПараметрыЗапроса    - СписокЗначений.
//  					ПараметрыСтатьиПростые - СписокЗначений.
//  					ПараметрыСтатьиСложные - СписокЗначений.
//						ПоПериодам			   - Булево.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица данных расчетов.
//
Функция ДанныеРасчетовОтчета(ВыбранныеРасчеты, ПараметрыЗапроса)
	
	ДанныеРасчетов = Новый ТаблицаЗначений;
	ДанныеРасчетов.Колонки.Добавить("Расчет");
	ДанныеРасчетов.Колонки.Добавить("Кодификатор");
	ДанныеРасчетов.Колонки.Добавить("ФормулаРасчета");
	ДанныеРасчетов.Колонки.Добавить("ПараметрыРасчета");
	ДанныеРасчетов.Колонки.Добавить("ВыводитьКоличество");
	ДанныеРасчетов.Колонки.Добавить("СложныйРасчет");
	ДанныеРасчетов.Колонки.Добавить("НеВключатьВИтоги");
		
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(ВыбранныеРасчеты);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыбранныеРасчеты", ВыбранныеРасчеты);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеРасчетов.Ссылка КАК Ссылка,
	|	ДанныеРасчетов.ФормулаРасчета КАК ФормулаРасчета,
	|	ДанныеРасчетов.Кодификатор КАК Кодификатор,
	|	ДанныеРасчетов.ВыводитьКоличество КАК ВыводитьКоличество,
	|	РасчетыПараметрыРасчета.ИмяПараметра КАК ИмяПараметра,
	|	РасчетыПараметрыРасчета.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ЕСТЬNULL(СтатьиБюджета.ЭтоРасчет, ЛОЖЬ) КАК ЭтоРасчет,
	|	ЕСТЬNULL(СтатьиБюджета.ЭтоГруппа, ЛОЖЬ) КАК ЭтоГруппа,
	|	ДанныеРасчетов.НеВключатьВИтоги КАК НеВключатьВИтоги
	|ИЗ
	|	Справочник.бит_СтатьиБюджета КАК ДанныеРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СтатьиБюджета.ПараметрыРасчета КАК РасчетыПараметрыРасчета
	|		ПО ДанныеРасчетов.Ссылка = РасчетыПараметрыРасчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СтатьиБюджета КАК СтатьиБюджета
	|		ПО (РасчетыПараметрыРасчета.ЗначениеПараметра = СтатьиБюджета.Ссылка)
	|ГДЕ
	|	ДанныеРасчетов.Ссылка В(&ВыбранныеРасчеты)
	|ИТОГИ ПО
	|	Ссылка";
	Результат = Запрос.Выполнить();	
	ВыборкаРасчетов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	НомерРасчета = 1;
	Пока ВыборкаРасчетов.Следующий() Цикл
		
		ФормулаРасчета = ВыборкаРасчетов.ФормулаРасчета;
		ЕстьДеление   = Найти(ФормулаРасчета, "/") <> 0;
		ЕстьУмножение = Найти(ФормулаРасчета, "*") <> 0;
		ЭтоСложныйРасчет = ЕстьДеление ИЛИ ЕстьУмножение;
		
		ПараметрыРасчета = Новый СписокЗначений;
			
		ЕстьНедоступныеСсылки = Ложь;
			
		НомерСтатьи = 1;
		
		ВыборкаПараметров = ВыборкаРасчетов.Выбрать();
		Пока ВыборкаПараметров.Следующий() Цикл
			ЗаполнитьПараметрыПоТекущему(ПараметрыЗапроса, ФормулаРасчета, ПараметрыРасчета, ВыборкаПараметров, 
				ЕстьНедоступныеСсылки, ЭтоСложныйРасчет);
		КонецЦикла;
		
		Если ЕстьНедоступныеСсылки Тогда
			
			ТекстСообщения = НСтр("ru='В расчете ""%1"" есть недоступные статьи бюджета'; 
								  |en='There are unavailable budget items in the calculation ""%1""'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ВыборкаРасчетов.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
		Иначе 
			
			ДанныеРасчета = ДанныеРасчетов.Добавить();
			ДанныеРасчета.Расчет  		   = ВыборкаРасчетов.Ссылка;
			ДанныеРасчета.Кодификатор 	   = ВыборкаРасчетов.Кодификатор;
			ДанныеРасчета.ФормулаРасчета   = ФормулаРасчета;
			ДанныеРасчета.ПараметрыРасчета = ПараметрыРасчета;
			
			ДанныеРасчета.ВыводитьКоличество = ВыборкаРасчетов.ВыводитьКоличество;
			ДанныеРасчета.СложныйРасчет      = ЭтоСложныйРасчет;
			ДанныеРасчета.НеВключатьВИтоги   = ВыборкаРасчетов.НеВключатьВИтоги;
						
			НомерРасчета = НомерРасчета + 1;
				
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеРасчетов;
	
КонецФункции

// Расчеты бюджета.

Функция ВсеРасчетыБюджета(Бюджет)

	// Все расчеты бюджета.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_СтатьиБюджета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_СтатьиБюджета КАК бит_СтатьиБюджета
	|ГДЕ
	|	бит_СтатьиБюджета.Владелец = &Владелец
	|	И бит_СтатьиБюджета.ЭтоРасчет = &ЭтоРасчет
	|	И НЕ бит_СтатьиБюджета.ПометкаУдаления
	|";
	Запрос.УстановитьПараметр("Владелец", Бюджет);
	Запрос.УстановитьПараметр("ЭтоРасчет", Истина);
	РасчетыБюджета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат РасчетыБюджета;
	
КонецФункции

#КонецОбласти 

Процедура НастроитьТекстЗапросаИФормулыИтогов(ПараметрыМодификации, ПараметрыЗапроса, ДанныеРасчетов)
	
	ТекстЗапроса = Вычислить("ПараметрыМодификации.СхемаКомпоновкиДанныхПоУмолчанию.НаборыДанных."
				   + ПараметрыМодификации.ПутьКНаборуДанных + ".Запрос");
					
	НаборДанныхСКД = Вычислить("ПараметрыМодификации.СхемаКомпоновкиДанных.НаборыДанных."
					 + ПараметрыМодификации.ПутьКНаборуДанных);
	
	ДополнитьПоляВыборкиОсновногоРезультата(ТекстЗапроса, ПараметрыЗапроса, НаборДанныхСКД, ПараметрыМодификации);
	ДополнитьВыборкуРасчетов(ТекстЗапроса, ПараметрыМодификации, ДанныеРасчетов, ПараметрыЗапроса);
	ОграничитьВыборкуДанныхИсточника(ТекстЗапроса, ПараметрыМодификации);
	
	НаборДанныхСКД.Запрос = ТекстЗапроса;
	
КонецПроцедуры

Процедура ДополнитьПоляВыборкиОсновногоРезультата(ТекстЗапроса, ПараметрыЗапроса, НаборДанныхСКД, ПараметрыМодификации)
	
	КоличествоПараметров = ПараметрыЗапроса.ВсеПараметрыЗапроса.Количество();
	Если КоличествоПараметров = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипСумма      = Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип;
	ТипКоличество = Новый ОписаниеТипов("Число",
						Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
						
	ШаблонПоля    = "%1%2Параметра%3";
	ШаблонВыборки = "0 КАК %1%2Параметра%3";
	РасчетныеПоля = Новый Массив;
	ПоляВывода    = Новый Массив;
	Для Вариация = 1 По ПараметрыМодификации.КоличествоВариацийРесурсов Цикл
		ИндексВариации = ?(ПараметрыМодификации.КоличествоВариацийРесурсов > 1, Вариация, "");
		Для Сч = 1 По КоличествоПараметров Цикл
			Инкремент = Формат(Сч, "ЧДЦ=0; ЧГ=");
			
			ИмяПоля = СтрШаблон(ШаблонПоля, "Сумма", ИндексВариации, Инкремент);
			ПоляВывода.Добавить(ИмяПоля);
			Если НаборДанныхСКД.Поля.Найти(ИмяПоля) = Неопределено Тогда
				бит_ОтчетыБФСервер.НовоеПолеНабора(НаборДанныхСКД, ИмяПоля,,, ТипСумма);
			КонецЕсли;
			ИмяПоля = СтрШаблон(ШаблонПоля, "Количество", ИндексВариации, Инкремент);
			ПоляВывода.Добавить(ИмяПоля);
			Если НаборДанныхСКД.Поля.Найти(ИмяПоля) = Неопределено Тогда
				бит_ОтчетыБФСервер.НовоеПолеНабора(НаборДанныхСКД, ИмяПоля,,, ТипКоличество);
			КонецЕсли;
			
			РасчетныеПоля.Добавить(СтрШаблон(ШаблонВыборки, "Сумма", ИндексВариации, Инкремент));
			РасчетныеПоля.Добавить(СтрШаблон(ШаблонВыборки, "Количество", ИндексВариации, Инкремент));
		КонецЦикла;
	КонецЦикла;
	
	РазделительПолей  = "," + Символы.ПС + Символы.Таб;
	
	ТекстПолейВывода  = РазделительПолей + СтрСоединить(ПоляВывода, РазделительПолей);
	ТекстЗапроса      = СтрЗаменить(ТекстЗапроса, "//#ПоляВывода", ТекстПолейВывода);
	
	ТекстПолейВыборки = РазделительПолей + СтрСоединить(РасчетныеПоля, РазделительПолей);
	ТекстЗапроса      = СтрЗаменить(ТекстЗапроса, "//#ОбластьРасчетныхПараметров", ТекстПолейВыборки);
	
КонецПроцедуры
						
Процедура ДополнитьВыборкуРасчетов(ТекстЗапроса, ПараметрыМодификации, ДанныеРасчетов, ПараметрыЗапроса)
	
	ШаблонТекстаРасчета   = ПараметрыМодификации.ШаблонТекстаРасчета;
	ШаблонСтатиРасчета    = "СтатьяРасчета%1";
	ШаблонПоляРесурса     = "%1Параметра%2";
	ШаблонПоля            = "%1 КАК %2%3Параметра%4";
	ФормулыПоСтатьям      = Новый Структура;
	ФормулыПоСтатьям.Вставить("ПростыеФормулыСуммы",      Новый Соответствие);
	ФормулыПоСтатьям.Вставить("ПростыеФормулыКоличества", Новый Соответствие);
	ФормулыПоСтатьям.Вставить("ФормулыСуммы",             Новый Соответствие);
	ФормулыПоСтатьям.Вставить("ФормулыКоличества",        Новый Соответствие);
	ФормулыПоСтатьям.Вставить("ФормулыИтоговСуммы",       Новый Соответствие);
	ФормулыПоСтатьям.Вставить("ФормулыИтоговКоличества",  Новый Соответствие);
	
	ВыборкиРасчетов = Новый Массив;
	СчетчикРасчетов = 1;
	Для каждого СтрокаРасчета Из ДанныеРасчетов Цикл
		Расчет     = СтрокаРасчета.Расчет;
		ПолеСтатьи = СтрШаблон(ШаблонСтатиРасчета, Формат(СчетчикРасчетов, "ЧДЦ=0; ЧГ="));
		УстановитьЗначениеПараметраСКД(ПараметрыМодификации.СхемаКомпоновкиДанных.Параметры, ПолеСтатьи, Расчет);
		
		СопоставлениеИменПараметров = Новый ТаблицаЗначений;
		СопоставлениеИменПараметров.Колонки.Добавить("СчетчикПараметра", Новый ОписаниеТипов("Число",
																		 Новый КвалификаторыЧисла(0, 0, ДопустимыйЗнак.Неотрицательный)));
		СопоставлениеИменПараметров.Колонки.Добавить("ИмяПараметраВФормуле");
		
		Для каждого ПараметрРасчета Из СтрокаРасчета.ПараметрыРасчета Цикл
			РасчетныеПоля = Новый Массив;
			Для Вариация = 1 По ПараметрыМодификации.КоличествоВариацийРесурсов Цикл
				ИндексВариации    = ?(ПараметрыМодификации.КоличествоВариацийРесурсов > 1, Вариация, "");
				СчетчикПараметров = 1;
				Для каждого ПараметрЗапроса Из ПараметрыЗапроса.ВсеПараметрыЗапроса Цикл
					Инкремент             = Формат(СчетчикПараметров, "ЧДЦ=0; ЧГ="); 
					ПолеВыборкиСуммы      = "0";
					ПолеВыборкиКоличества = "0";
					Если ПараметрЗапроса.Представление = ПараметрРасчета.Представление Тогда
						ПолеВыборкиСуммы = "ОборотыРезультат.Сумма" + ИндексВариации;
						Если СтрокаРасчета.ВыводитьКоличество ИЛИ (СтрНайти(СтрокаРасчета.ФормулаРасчета, ".Количество") > 0) Тогда
							ПолеВыборкиКоличества = "ОборотыРезультат.Количество" + ИндексВариации;
						КонецЕсли;
						СопоставлениеПараметра = СопоставлениеИменПараметров.Добавить();
						СопоставлениеПараметра.СчетчикПараметра     = СчетчикПараметров;
						СопоставлениеПараметра.ИмяПараметраВФормуле = ПараметрЗапроса.Представление;
					КонецЕсли;
					РасчетныеПоля.Добавить(СтрШаблон(ШаблонПоля, ПолеВыборкиСуммы, "Сумма", ИндексВариации, Инкремент));
					РасчетныеПоля.Добавить(СтрШаблон(ШаблонПоля, ПолеВыборкиКоличества, "Количество", ИндексВариации, Инкремент));
					СчетчикПараметров = СчетчикПараметров + 1;
				КонецЦикла;
			КонецЦикла;
			
			ТекстВыборкиРасчетов = СтрЗаменить(ШаблонТекстаРасчета, "&СтатьяРасчета", "&" + ПолеСтатьи);
			ТекстВыборкиРасчетов = СтрЗаменить(ТекстВыборкиРасчетов,
				"&ОбластьРасчетныхПараметров КАК ОбластьРасчетныхПараметров",
				СтрСоединить(РасчетныеПоля, "," + Символы.ПС + Символы.Таб));
			ТекстВыборкиРасчетов = СтрЗаменить(ТекстВыборкиРасчетов, "&ЗначениеОтбораПараметра",
				"&" + ПараметрРасчета.Представление);
			ВыборкиРасчетов.Добавить(ТекстВыборкиРасчетов);
		КонецЦикла;
		
		ФормулаСуммыСтатьи      = СтрокаРасчета.ФормулаРасчета;
		ФормулаКоличестваСтатьи = СтрокаРасчета.ФормулаРасчета;
		СопоставлениеИменПараметров.Сортировать("СчетчикПараметра Убыв");
		Для каждого СопоставлениеПараметра Из СопоставлениеИменПараметров Цикл
			Инкремент          = Формат(СопоставлениеПараметра.СчетчикПараметра, "ЧДЦ=0; ЧГ=");
			ИмяПоляКоличество  = СтрШаблон(ШаблонПоляРесурса, "Количество", Инкремент);
			ФормулаСуммыСтатьи = СтрЗаменить(ФормулаСуммыСтатьи,
									СопоставлениеПараметра.ИмяПараметраВФормуле + ".Количество", ИмяПоляКоличество);
			
			ИмяПоляСумма       = СтрШаблон(ШаблонПоляРесурса, "Сумма", Инкремент);
			ФормулаСуммыСтатьи = СтрЗаменить(ФормулаСуммыСтатьи, СопоставлениеПараметра.ИмяПараметраВФормуле, ИмяПоляСумма);
			Если СтрокаРасчета.ВыводитьКоличество Тогда
				ФормулаКоличестваСтатьи = СтрЗаменить(ФормулаКоличестваСтатьи,
					СопоставлениеПараметра.ИмяПараметраВФормуле + ".Количество", ИмяПоляКоличество);
				ФормулаКоличестваСтатьи = СтрЗаменить(ФормулаКоличестваСтатьи, СопоставлениеПараметра.ИмяПараметраВФормуле,
											ИмяПоляКоличество);
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаРасчета.СложныйРасчет Тогда
			ФормулыПоСтатьям.ФормулыСуммы.Вставить(ПолеСтатьи, ФормулаСуммыСтатьи);
			Если НЕ СтрокаРасчета.НеВключатьВИтоги Тогда
				ФормулыПоСтатьям.ФормулыИтоговСуммы.Вставить(ПолеСтатьи, ФормулаСуммыСтатьи);
			КонецЕсли;
			Если СтрокаРасчета.ВыводитьКоличество Тогда
				ФормулыПоСтатьям.ФормулыКоличества.Вставить(ПолеСтатьи, ФормулаКоличестваСтатьи);
				Если НЕ СтрокаРасчета.НеВключатьВИтоги Тогда
					ФормулыПоСтатьям.ФормулыИтоговКоличества.Вставить(ПолеСтатьи, ФормулаКоличестваСтатьи);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ФормулыПоСтатьям.ПростыеФормулыСуммы.Вставить(ПолеСтатьи, ФормулаСуммыСтатьи);
			Если СтрокаРасчета.ВыводитьКоличество Тогда
				ФормулыПоСтатьям.ПростыеФормулыКоличества.Вставить(ПолеСтатьи, ФормулаКоличестваСтатьи);
			КонецЕсли;
		КонецЕсли;
		
		СчетчикРасчетов = СчетчикРасчетов + 1;
	КонецЦикла;
	
	НастроитьФормулыРасчетаРесурсов(ПараметрыМодификации, ФормулыПоСтатьям);
	
	ТекстДополенияРасчетами = "";
	Если ВыборкиРасчетов.Количество() > 0 Тогда
		ТекстДополенияРасчетами = СтрСоединить(ВыборкиРасчетов, ОбщегоНазначения.ТекстОбъединитьВсе());
		ВыполнитьГруппировкуВТексеРасчетов(ТекстДополенияРасчетами, ПараметрыМодификации, ПараметрыЗапроса);
		ТекстДополенияРасчетами = ОбщегоНазначения.ТекстОбъединитьВсе() + ТекстДополенияРасчетами;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//#Расчеты", ТекстДополенияРасчетами);
	
КонецПроцедуры

Процедура НастроитьФормулыРасчетаРесурсов(ПараметрыМодификации, ФормулыПоСтатьям)
	
	СброситьФормулыПоУмолчанию(ПараметрыМодификации, "ВычисляемыеПоля");
	СброситьФормулыПоУмолчанию(ПараметрыМодификации, "ПоляИтога");
	
	НастритьФормулыСтатейВычисляемыхПолей(ПараметрыМодификации, ФормулыПоСтатьям);
	НастритьФормулыСтатейРасчетовСтатей(ПараметрыМодификации, ФормулыПоСтатьям);
	НастритьФормулыСтатейРасчетовИтогов(ПараметрыМодификации, ФормулыПоСтатьям);
	
КонецПроцедуры

Процедура СброситьФормулыПоУмолчанию(ПараметрыМодификации, ИмяХранилищаПолей)
	
	ИндексРесурса = -1;
	Для каждого ПолеПоУмолчанию Из ПараметрыМодификации.СхемаКомпоновкиДанныхПоУмолчанию[ИмяХранилищаПолей] Цикл
		ИндексРесурса = ИндексРесурса + 1;
		
		ПолеОтчета = ПараметрыМодификации.СхемаКомпоновкиДанных[ИмяХранилищаПолей][ИндексРесурса];
		Если ПолеОтчета.ПутьКДанным = "ДинамическийПериод" Тогда
			Продолжить;
		КонецЕсли;
		ПолеОтчета.Выражение = ПолеПоУмолчанию.Выражение;
	КонецЦикла;
	
КонецПроцедуры

Процедура НастритьФормулыСтатейРасчетовИтогов(ПараметрыМодификации, ФормулыПоСтатьям)
	
	Для каждого ПолеИтога Из ПараметрыМодификации.СхемаКомпоновкиДанных.ПоляИтога Цикл
		ФормулаРесурса      = ПолеИтога.Выражение;
		Если СтрНачинаетсяС(ФормулаРесурса, "ВычислитьВыражение(") Тогда
			// В формулы расчета подставляется полная формула выражения ресурса.
			ПолеИтога.Выражение = ФормулаСуммыИтогаПоСтатьям(ФормулаРесурса, ПараметрыМодификации, ФормулыПоСтатьям);
		ИначеЕсли СтрНайти(ФормулаРесурса, "НеВключатьВИтоги") > 0 Тогда
			// Вычисляем отдельно формулы расчета по статьям для каждого оператора и заменяем в общей формуле.
			ФормулыПодменыОператоров = Новый Соответствие;
			Для каждого ОписаниеРесурса Из ПараметрыМодификации.ОписаниеРесурсов Цикл
				ИмяРесурса = ОписаниеРесурса.ИмяРесурса;
				ИмяРесурса = СтрЗаменить(ИмяРесурса, ОписаниеРесурса.ВидРесурса, ОписаниеРесурса.ВидРесурса + "НеВключатьВИтоги");
				ФормулаОператора = "Сумма(" + ИмяРесурса + ")";
				Если СтрНайти(ФормулаРесурса, ФормулаОператора) > 0 Тогда
					ФормулыПодменыОператоров.Вставить(ФормулаОператора);
				КонецЕсли;
			КонецЦикла;
			Для каждого ЭлементСоответствия Из ФормулыПодменыОператоров Цикл
				Оператор       = ЭлементСоответствия.Ключ;
				ФормулаСуммы   = ФормулаСуммыИтогаПоСтатьям(Оператор, ПараметрыМодификации, ФормулыПоСтатьям);
				ФормулаРесурса = СтрЗаменить(ФормулаРесурса, Оператор, "(" + ФормулаСуммы + ")");
			КонецЦикла;
			ПолеИтога.Выражение = ФормулаРесурса;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ФормулаСуммыИтогаПоСтатьям(ФормулаРесурса, ПараметрыМодификации, ФормулыПоСтатьям)
	
	ШаблонСлагаемого = "%1 + ЕСТЬNULL(%2, 0)";
	ФормулаСуммы     = ФормулаРесурса;
	ФормулаРесурсаБезОкончанияИтогов = СтрЗаменить(ФормулаРесурса, "НеВключатьВИтоги", "");
	
	Для каждого ОписаниеРесурса Из ПараметрыМодификации.ОписаниеРесурсов Цикл
		ИмяРесурса = ОписаниеРесурса.ИмяРесурса;
		ИмяРесурса = СтрЗаменить(ИмяРесурса, ОписаниеРесурса.ВидРесурса, ОписаниеРесурса.ВидРесурса + "НеВключатьВИтоги");
		
		Если СтрНайти(ФормулаРесурса, ИмяРесурса) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущиеФормулыПоСтатьям = ?(ОписаниеРесурса.ВидРесурса = "Сумма", ФормулыПоСтатьям.ФормулыИтоговСуммы,
									ФормулыПоСтатьям.ФормулыИтоговКоличества);
		Если ТекущиеФормулыПоСтатьям = Неопределено ИЛИ ТекущиеФормулыПоСтатьям.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ФормулаРасчета = "";
		Для каждого СтрокаФормулы Из ТекущиеФормулыПоСтатьям Цикл
			ФормулаВыражения = ФормулаВыраженияРасчетаСтатьи(СтрокаФормулы.Значение, ОписаниеРесурса, Ложь,
								ФормулаРесурсаБезОкончанияИтогов);
			ФормулаСуммы     = СтрШаблон(ШаблонСлагаемого, ФормулаСуммы, ФормулаВыражения);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ФормулаСуммы;
	
КонецФункции

Функция ВыделитьПараметрФормулы(ФормулаСтатьи, ПарметрФормулы)
	
	ПарметрФормулы = Неопределено;
	
	НачалоПараметра = СтрНайти(ФормулаСтатьи, "[");
	Если НачалоПараметра = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОкончаниеПераметра = СтрНайти(ФормулаСтатьи, "]");
	Если ОкончаниеПераметра = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПарметрФормулы = Сред(ФормулаСтатьи, НачалоПараметра + 1, ОкончаниеПераметра - НачалоПараметра - 1);
	
	Возврат Истина;
	
КонецФункции

Процедура НастритьФормулыСтатейРасчетовСтатей(ПараметрыМодификации, ФормулыПоСтатьям)
	
	ШаблонРасчетаПоСтатье =
	"
	|	КОГДА Статья = &%1 ТОГДА
	|		Коэффициент * %2";
	
	Для каждого ПолеИтога Из ПараметрыМодификации.СхемаКомпоновкиДанных.ПоляИтога Цикл
		ФормулаРесурса = ПолеИтога.Выражение;
		
		Для каждого ОписаниеРесурса Из ПараметрыМодификации.ОписаниеРесурсов Цикл
			ИмяРесурса = ОписаниеРесурса.ИмяРесурса;
			ИмяРесурса = "Сумма(" + ИмяРесурса + ")";
			
			Если СтрНайти(ПолеИтога.Выражение, ИмяРесурса) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущиеФормулыПоСтатьям = ?(ОписаниеРесурса.ВидРесурса = "Сумма", ФормулыПоСтатьям.ФормулыСуммы,
										ФормулыПоСтатьям.ФормулыКоличества);
			Если ТекущиеФормулыПоСтатьям = Неопределено ИЛИ ТекущиеФормулыПоСтатьям.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ФормулаРасчета = "";
			Для каждого СтрокаФормулы Из ТекущиеФормулыПоСтатьям Цикл
				ФормулаВыражения = ФормулаВыраженияРасчетаСтатьи(СтрокаФормулы.Значение, ОписаниеРесурса);
				ФормулаРасчета   = ФормулаРасчета + СтрШаблон(ШаблонРасчетаПоСтатье, СтрокаФормулы.Ключ, ФормулаВыражения);
			КонецЦикла;
			
			ФормулаРасчета =
			"ВЫБОР" + ФормулаРасчета +
			"
			|	ИНАЧЕ " + ИмяРесурса + "
			|КОНЕЦ";
			ПолеИтога.Выражение = СтрЗаменить(ПолеИтога.Выражение, ИмяРесурса, ФормулаРасчета);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура НастритьФормулыСтатейВычисляемыхПолей(ПараметрыМодификации, ФормулыПоСтатьям)
	
	ШаблонРасчетаПоСтатье =
	"
	|	КОГДА Статья = &%1 ТОГДА
	|		%2";
	
	Для каждого ВычисляемоеПоле Из ПараметрыМодификации.СхемаКомпоновкиДанных.ВычисляемыеПоля Цикл
		ФормулаРесурса = ВычисляемоеПоле.Выражение;
		
		Для каждого ОписаниеРесурса Из ПараметрыМодификации.ОписаниеРесурсов Цикл
			ИмяРесурса = ОписаниеРесурса.ИмяРесурса;
			
			Если СтрНайти(ВычисляемоеПоле.Выражение, ИмяРесурса) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущиеФормулыПоСтатьям = ?(ОписаниеРесурса.ВидРесурса = "Сумма", ФормулыПоСтатьям.ПростыеФормулыСуммы,
				ФормулыПоСтатьям.ПростыеФормулыКоличества);
			Если ТекущиеФормулыПоСтатьям = Неопределено ИЛИ ТекущиеФормулыПоСтатьям.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ФормулаРасчета = "";
			Для каждого СтрокаФормулы Из ТекущиеФормулыПоСтатьям Цикл
				ФормулаВыражения = ФормулаВыраженияРасчетаСтатьи(СтрокаФормулы.Значение, ОписаниеРесурса, Ложь);
				ФормулаРасчета   = ФормулаРасчета + СтрШаблон(ШаблонРасчетаПоСтатье, СтрокаФормулы.Ключ, ФормулаВыражения);
			КонецЦикла;
			
			ФормулаРасчета =
			"ВЫБОР" + ФормулаРасчета +
			"
			|	ИНАЧЕ " + ИмяРесурса + "
			|КОНЕЦ";
			ВычисляемоеПоле.Выражение = СтрЗаменить(ВычисляемоеПоле.Выражение, ИмяРесурса, ФормулаРасчета);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ФормулаВыраженияРасчетаСтатьи(Знач ФормулаСтатьи, ОписаниеРесурса, СложныйРасчет = Истина, ФормулаРасчета = "")
	
	ИмяРесурса = ОписаниеРесурса.ИмяРесурса;
	Вариация   = ОписаниеРесурса.Вариация;
	
	ПарметрФормулы = Неопределено;
	Пока ВыделитьПараметрФормулы(ФормулаСтатьи, ПарметрФормулы) Цикл
		ШаблонПараметра = "[" + ПарметрФормулы + "]";
		РесурсПараметра = ПарметрФормулы;
		Если Вариация > 0 Тогда
			РесурсПараметра = СтрЗаменить(РесурсПараметра, "Сумма", "Сумма" + Вариация);
			РесурсПараметра = СтрЗаменить(РесурсПараметра, "Количество", "Количество" + Вариация);
		КонецЕсли;
		ИмяРесурсаПодмены = РесурсПараметра;
		Если СложныйРасчет Тогда
			ИмяРесурсаПодмены = "Сумма(" + ИмяРесурсаПодмены + ")";
		КонецЕсли;
		Если НЕ ПустаяСтрока(ФормулаРасчета) Тогда
			ИмяРесурсаПодмены = СтрЗаменить(ФормулаРасчета, ИмяРесурса, ИмяРесурсаПодмены);
		КонецЕсли;
		ФормулаСтатьи = СтрЗаменить(ФормулаСтатьи, ШаблонПараметра, ИмяРесурсаПодмены);
	КонецЦикла;
	
	Возврат ФормулаСтатьи;	
	
КонецФункции

Процедура ВыполнитьГруппировкуВТексеРасчетов(ТекстРасчетов, ПараметрыМодификации, ПараметрыЗапроса)
	
	Если ПараметрыМодификации.КоличествоВариацийРесурсов = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстГруппировкиРасчетов =
	"ВЫБРАТЬ
	|	&ПоляВыборки,
	|	&ПоляСуммирования
	|ИЗ
	|(&ТекстРасчетов) КАК ТаблицыРасчетов
	|СГРУППИРОВАТЬ ПО
	|	&ПоляГруппировки";	
	
	СтрокиВыборки   = СтрРазделить(ПараметрыМодификации.ШаблонТекстаРасчета, ",", Ложь);
	ПоляВыборки     = Новый Массив;
	ШаблонВыборки   = "ТаблицыРасчетов.%1 КАК %1";
	ПоляГруппировки = Новый Массив;
	Для каждого СтрокаВыборки Из СтрокиВыборки Цикл
		Если СтрНайти(СтрокаВыборки, "&ОбластьРасчетныхПараметров") > 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияСинонима = СтрНайти(СтрокаВыборки, " КАК ");
		Если ПозицияСинонима = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ИмяПоля = СокрЛП(Сред(СтрокаВыборки, ПозицияСинонима + 5));
		ПоляГруппировки.Добавить(ИмяПоля);
		ПоляВыборки.Добавить(СтрШаблон(ШаблонВыборки, ИмяПоля)); 
	КонецЦикла;
	
	ПоляСуммирования            = Новый Массив;
	ШаблонВыборкиСуммирования   = "Сумма(ТаблицыРасчетов.%1) КАК %1";
	ШаблонИменяПоляСуммирования = "%1%2Параметра%3";
	КоличествоПараметров   = ПараметрыЗапроса.ВсеПараметрыЗапроса.Количество();
	Для Вариация = 1 По ПараметрыМодификации.КоличествоВариацийРесурсов Цикл
		Для НомерПараметра = 1 По КоличествоПараметров Цикл
			Инкремент = Формат(НомерПараметра, "ЧДЦ=0; ЧГ=");
			ИмяПоля   = СтрШаблон(ШаблонИменяПоляСуммирования, "Сумма", Вариация, Инкремент); 
			ПоляСуммирования.Добавить(СтрШаблон(ШаблонВыборкиСуммирования, ИмяПоля));
			ИмяПоля   = СтрШаблон(ШаблонИменяПоляСуммирования, "Количество", Вариация, Инкремент); 
			ПоляСуммирования.Добавить(СтрШаблон(ШаблонВыборкиСуммирования, ИмяПоля));
		КонецЦикла;
	КонецЦикла;
	
	РазделительПолей         = "," + Символы.ПС + Символы.Таб;
	ТекстГруппировкиРасчетов = СтрЗаменить(ТекстГруппировкиРасчетов, "&ПоляВыборки",
								СтрСоединить(ПоляВыборки, РазделительПолей));
	ТекстГруппировкиРасчетов = СтрЗаменить(ТекстГруппировкиРасчетов, "&ПоляСуммирования",
								СтрСоединить(ПоляСуммирования, РазделительПолей));
	ТекстГруппировкиРасчетов = СтрЗаменить(ТекстГруппировкиРасчетов, "&ТекстРасчетов", ТекстРасчетов);
	ТекстГруппировкиРасчетов = СтрЗаменить(ТекстГруппировкиРасчетов, "&ПоляГруппировки",
								СтрСоединить(ПоляГруппировки, РазделительПолей));
								
	ТекстРасчетов = ТекстГруппировкиРасчетов;
	
КонецПроцедуры

// Функция формирует текст основного результата.
//
// Параметры:
//  ТекстЗапроса    - Строка.
//  ИсключаемыеПоля - Массив.
//
// Возвращаемое значение:
//  Строка.
//
Функция ИзменитьТекстОсновногоРезультата(Знач ТекстЗапроса, ДанныеГруппировок)

	ИсключаемыеПоля = ДанныеГруппировок.ИсключаемыеПоля;
	
	ТекстОсновногоРезультата = ТекстЗапроса;
	Для каждого ПолеИсключаемое Из ИсключаемыеПоля Цикл	
		ТекстЗаменяемый = СтрШаблон("ВТОборотыДляРасчетов.%1,", ПолеИсключаемое);
		ТекстОсновногоРезультата = СтрЗаменить(ТекстОсновногоРезультата, ТекстЗаменяемый, "NULL,");
		Если ПолеИсключаемое = "Аналитика_1" Тогда
			ТекстЗаменяемый = "ВТОборотыДляРасчетов.Аналитика_1 КАК";
			ТекстОсновногоРезультата = СтрЗаменить(ТекстОсновногоРезультата, ТекстЗаменяемый, "NULL КАК");
		Иначе 
			ТекстЗаменяемый = СтрШаблон("ВТОборотыДляРасчетов.%1", ПолеИсключаемое);
			ТекстОсновногоРезультата = СтрЗаменить(ТекстОсновногоРезультата, ТекстЗаменяемый, "NULL");
		КонецЕсли;		
	КонецЦикла;
			
	Возврат ТекстОсновногоРезультата;

КонецФункции

// Процедура меняет текст запроса для СКД и подставляет фиксированные параметры.
//
// Параметры:
//  ИмяОтчета 			  - Строка.
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных.
//  КомпоновщикНастроек.
//
Процедура УстановитьПараметрыОтчетаСРасчетами(ПараметрыСКД, ВсеПараметрыЗапроса)
	
	// Установка параметров в СКД.
	Для каждого ПараметрРасчетов Из ВсеПараметрыЗапроса Цикл
		УстановитьЗначениеПараметраСКД(ПараметрыСКД, ПараметрРасчетов.Представление, ПараметрРасчетов.Значение);
	КонецЦикла;	

КонецПроцедуры

Процедура УстановитьЗначениеПараметраСКД(ПараметрыСКД, ИмяПараметра, ЗначениеПараметра)
	
	ИскомыйПараметр = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	ПараметрСхемы   = ПараметрыСКД.Найти(ИскомыйПараметр);
	Если ПараметрСхемы = Неопределено Тогда
		ПараметрСхемы = ПараметрыСКД.Добавить();
		ПараметрСхемы.Имя = ИмяПараметра;			
	КонецЕсли;		
	ПараметрСхемы.Значение = ЗначениеПараметра;
	ПараметрСхемы.ОграничениеИспользования = Истина;
	
КонецПроцедуры

Процедура ОграничитьВыборкуДанныхИсточника(ТекстЗапроса, ПараметрыМодификации)
	
	НастройкиКомпоновки = ПараметрыМодификации.КомпоновщикНастроек.ПолучитьНастройки();
	ИспользуемыеПоля    = ИспользуемыеПоляНастройкиКомпоновки(НастройкиКомпоновки);
	ОграничитьВыборкуИзмеренийИсточника(ТекстЗапроса, ИспользуемыеПоля);
	ОграничитьВыборкуРегистратораИсточника(ТекстЗапроса, ИспользуемыеПоля);
	ОграничитьВыборкуПериодаИсточника(ТекстЗапроса, ИспользуемыеПоля);
	
КонецПроцедуры

Функция ИспользуемыеПоляНастройкиКомпоновки(НастройкиКомпоновки)
	
	ИспользуемыеПоля = Новый СписокЗначений;
	
	ДобавитьИспользуемыеПоляНастройкиКомпоновки(ИспользуемыеПоля, НастройкиКомпоновки);
	
	Если ИспользуемыеПоля.НайтиПоЗначению("СтатьяОборотов") = Неопределено Тогда
		// Поле используется в рассчетах.
		ИспользуемыеПоля.Добавить("СтатьяОборотов");
	КонецЕсли;
	
	Если ИспользуемыеПоля.НайтиПоЗначению("ДинамическийПериод") <> Неопределено Тогда
		ПараметрПериодичность = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(НастройкиКомпоновки, "Периодичность");
		ДлительностьПериода   = ОбщегоНазначения.ИмяЗначенияПеречисления(ПараметрПериодичность.Значение);
		ИспользуемоеПоле      = "Период" + ДлительностьПериода;
		Если ИспользуемыеПоля.НайтиПоЗначению(ИспользуемоеПоле) = Неопределено Тогда
			ИспользуемыеПоля.Добавить(ИспользуемоеПоле);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИспользуемыеПоля;
	
КонецФункции

Процедура ДобавитьИспользуемыеПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктурыНастройки)
	
	Если ТипЗнч(ЭлементСтруктурыНастройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		ДобавитьПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктурыНастройки.Выбор);
		ДобавитьПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктурыНастройки.Отбор);
		
		Для каждого ЭлементСтруктуры Из ЭлементСтруктурыНастройки.Структура Цикл
			Если НЕ ЭлементСтруктуры.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьИспользуемыеПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктуры);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЭлементСтруктурыНастройки) = Тип("ГруппировкаКомпоновкиДанных")
		ИЛИ ТипЗнч(ЭлементСтруктурыНастройки) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
		ИЛИ ТипЗнч(ЭлементСтруктурыНастройки) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		ДобавитьПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктурыНастройки.Выбор);
		ДобавитьПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктурыНастройки.Отбор);
		ДобавитьПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктурыНастройки.ПоляГруппировки);
		
		Для каждого ЭлементСтруктуры Из ЭлементСтруктурыНастройки.Структура Цикл
			Если НЕ ЭлементСтруктуры.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьИспользуемыеПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктуры);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЭлементСтруктурыНастройки) = Тип("ТаблицаКомпоновкиДанных") Тогда
		ДобавитьПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктурыНастройки.Выбор);
		
		Для каждого СтрокаТаблицы Из ЭлементСтруктурыНастройки.Строки Цикл
			Если НЕ СтрокаТаблицы.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьИспользуемыеПоляНастройкиКомпоновки(ИспользуемыеПоля, СтрокаТаблицы);
		КонецЦикла;
		
		Для каждого КолонкаТаблицы Из ЭлементСтруктурыНастройки.Колонки Цикл
			Если НЕ КолонкаТаблицы.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьИспользуемыеПоляНастройкиКомпоновки(ИспользуемыеПоля, КолонкаТаблицы);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЭлементСтруктурыНастройки) = Тип("ДиаграммаКомпоновкиДанных") Тогда
		ДобавитьПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементСтруктурыНастройки.Выбор);
		
		Для каждого СерияДиаграммы Из ЭлементСтруктурыНастройки.Серии Цикл
			Если НЕ СерияДиаграммы.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьИспользуемыеПоляНастройкиКомпоновки(ИспользуемыеПоля, СерияДиаграммы);
		КонецЦикла;
		
		Для каждого ТочкаДиаграммы Из ЭлементСтруктурыНастройки.Точки Цикл
			Если НЕ ТочкаДиаграммы.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьИспользуемыеПоляНастройкиКомпоновки(ИспользуемыеПоля, ТочкаДиаграммы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоляНастройкиКомпоновки(ИспользуемыеПоля, КоллекцияПолейКомпоновки)
	
	Для каждого ЭлементКоллекции Из КоллекцияПолейКомпоновки.Элементы Цикл
		ТипЭлемента = ТипЗнч(ЭлементКоллекции);
		Если ТипЭлемента = Тип("АвтоВыбранноеПолеКомпоновкиДанных") ИЛИ НЕ ЭлементКоллекции.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЭлемента = Тип("ГруппаВыбранныхПолейКомпоновкиДанных")
			ИЛИ ТипЭлемента = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ДобавитьПоляНастройкиКомпоновки(ИспользуемыеПоля, ЭлементКоллекции);
		ИначеЕсли ТипЭлемента = Тип("ПолеГруппировкиКомпоновкиДанных")
			ИЛИ ТипЭлемента = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			ДобавитьПолеИсточникаИзПоляКомпоновки(ИспользуемыеПоля, ЭлементКоллекции.Поле);
		ИначеЕсли ТипЭлемента = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ДобавитьПолеИсточникаИзПоляКомпоновки(ИспользуемыеПоля, ЭлементКоллекции.ЛевоеЗначение);
			ДобавитьПолеИсточникаИзПоляКомпоновки(ИспользуемыеПоля, ЭлементКоллекции.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПолеИсточникаИзПоляКомпоновки(ИспользуемыеПоля, ПолеКомпоновкиДанных)
	
	Если ТипЗнч(ПолеКомпоновкиДанных) <> Тип("ПолеКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	ПолныйПутьКДанным = Строка(ПолеКомпоновкиДанных);
	Если ПустаяСтрока(ПолныйПутьКДанным) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыПутиКДанным = СтрРазделить(ПолныйПутьКДанным, ".");
	ПолеИсточника       = ЭлементыПутиКДанным[0];
	Если ИспользуемыеПоля.НайтиПоЗначению(ПолеИсточника) = Неопределено Тогда
		ИспользуемыеПоля.Добавить(ПолеИсточника);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОграничитьВыборкуИзмеренийИсточника(ТекстЗапроса, ИспользуемыеПоля)
	
	Для каждого ИзмерениеОборотов Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл
		ИмяИзмерения = ИзмерениеОборотов.Имя;
		Если ИспользуемыеПоля.НайтиПоЗначению(ИмяИзмерения) <> Неопределено Тогда
			Продолжить; 
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрШаблон("ТаблицаОборотыИсточник.%1 КАК", ИмяИзмерения), "NULL КАК");
	КонецЦикла;
	
КонецПроцедуры

Процедура ОграничитьВыборкуРегистратораИсточника(ТекстЗапроса, ИспользуемыеПоля)
	
	Если ИспользуемыеПоля.НайтиПоЗначению("ТипДокумента") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТИПЗНАЧЕНИЯ(ТаблицаОборотыИсточник.Регистратор) КАК ТипДокумента,",
												"NULL КАК ТипДокумента,");
	КонецЕсли;
	
	Если ИспользуемыеПоля.НайтиПоЗначению("Регистратор") = Неопределено
		И ИспользуемыеПоля.НайтиПоЗначению("СтатусДокумента") = Неопределено
		И ИспользуемыеПоля.НайтиПоЗначению("Комментарий") = Неопределено Тогда
	    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаОборотыИсточник.Регистратор КАК Регистратор,",
												"NULL КАК Регистратор,");
	КонецЕсли;
	
	Если ИспользуемыеПоля.НайтиПоЗначению("НомерСтроки") = Неопределено
		И ИспользуемыеПоля.НайтиПоЗначению("Комментарий") = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаОборотыИсточник.НомерСтроки КАК НомерСтроки,",
												"NULL КАК НомерСтроки,");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОграничитьВыборкуПериодаИсточника(ТекстЗапроса, ИспользуемыеПоля)
	
	ПоляПериодов = Новый Массив;
	ПоляПериодов.Добавить("ПериодСекунда");
	ПоляПериодов.Добавить("ПериодДень");
	ПоляПериодов.Добавить("ПериодНеделя");
	ПоляПериодов.Добавить("ПериодДекада");
	ПоляПериодов.Добавить("ПериодМесяц");
	ПоляПериодов.Добавить("ПериодКвартал");
	ПоляПериодов.Добавить("ПериодПолугодие");
	ПоляПериодов.Добавить("ПериодГод");
	
	Для каждого ПолеПериода Из ПоляПериодов Цикл
		Если ИспользуемыеПоля.НайтиПоЗначению(ПолеПериода) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрШаблон("ТаблицаОборотыИсточник.%1", ПолеПериода), "ДАТАВРЕМЯ(1, 1, 1)");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
